Revit 2027 API
KeyBasedTreeEntry.GetChildrenKeys Method
 Gets a collection containing the keys of all children entry objects from this entry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetChildrenKeys()
Public Function GetChildrenKeys As IList(Of String)
public:
IList<String^>^ GetChildrenKeys()
member GetChildrenKeys : unit -> IList<string>
Return Value
IList<String>
 The collection containing the keys of all children entry objects from this entry.
Remarks
 To look up the entry object corresponding to the child keys using KeyBasedTreeEntries.FindEntry().
See Also
Reference
KeyBasedTreeEntry Class
Autodesk.Revit.DB Namespace